content/posts/my-take-on-the-composable-architecture.md
+++
title = "My take on The Composable Architecture"
author = ["Abram Perdanaputra"]
date = 2020-10-25T10:08:00+07:00
draft = false
+++

<div class="ox-hugo-toc toc local">
<div></div>

- [Context: Typical iOS App Architecture](#context-typical-ios-app-architecture)
- [The claim](#the-claim)
- [Experiments](#experiments)
- [What I love](#what-i-love)
- [What I don't love](#what-i-don-t-love)
- [Where should I go next?](#where-should-i-go-next)
- [References](#references)

</div>
<!--endtoc-->

The Composable Architecture or TCA for short is a library to build application in a consistent and understandable manner, with composition, testing, and ergonomics in mind. This library is made by Point-Free to apply the concepts of functional programming in a practical way.


## Context: Typical iOS App Architecture {#context-typical-ios-app-architecture}

In the world of iOS development, there's a few 4 most commonly used patterns in architecting an iOS application. Most notably MVC, MVP, MVVM, and VIPER. The details of these architecture is beyond the scope of this article. All these architecture has their own advantages and drawbacks. For example, MVC is simple but misusing it will cause a Massive View Controller. VIPER provides a good testability but it'll generate much boilerplate code. At the end of the day, architectural decisions are based on the combination of use case, complexity, and many other variables. So there's no such thing as the silver bullet of iOS architecture.


## The claim {#the-claim}

As the new guy in the iOS architecture neighborhood, TCA claims to provide:

-   **Consistency**: degree of firmness, density, viscosity, or resistance to movement or separation of constituent particles
-   **Composition**: a product of mixing or combining various elements or ingredients
-   **Testing**
-   **Ergonomics**: a product of mixing or combining various elements or ingredients

In this blog, we'll test whether TCA fulfills what it claims to do or not.


## Experiments {#experiments}

We'll create a song reader app that have the capability to add songs to favorites and see all the favorites we have. All the code snippet in this blog is taken from my [Lagu Sion implementation](https://github.com/abrampers/lagu-sion-ios).


### Setting up {#setting-up}

To install this library, generate a new iOS application in your Xcode and add TCA to your Swift Package Dependency. More info, [head here](https://github.com/pointfreeco/swift-composable-architecture#installation).


### Building the app {#building-the-app}

In this blog, I'll build the app from the smallest component possible and work ourselves up and wire everything up.


#### Modeling song {#modeling-song}

Simple, we can make a struct that contains all the fields needed. In this case we need to generate the id and song

```swift

public struct Song: Equatable, Identifiable {
    public let id: UUID
    public let number: Int
    public let title: String
    public let verses: [Verse]
    public let reff: Verse?
    public let songBook: SongBook

    public init(id: UUID, number: Int, title: String, verses: [Verse], reff: Verse? = nil, songBook: SongBook) {
        self.id = id
        self.number = number
        self.title = title
        self.verses = verses
        self.reff = reff
        self.songBook = songBook
    }

    public var prefix: String { songBook.prefix }
    public var color: Color { songBook.color }
}

public struct SongViewState: Equatable, Identifiable {
    public var id: UUID {
        return song.id
    }

    public var song: Song
    public var isFavorite: Bool

    public init(song: Song, isFavorite: Bool) {
        self.song = song
        self.isFavorite = isFavorite
    }
}

extension SongViewState {
    var number: Int { song.number }
    var title: String { song.title }
    var verses: [Verse] { song.verses }
    var reff: Verse? { song.reff }
    var prefix: String { song.prefix }
    var color: Color { song.color }
}
```


#### Modeling action to be made on Song View {#modeling-action-to-be-made-on-song-view}

Simple, just use Swift’s enum to enumerate all the possible action.

```swift

public enum SongAction: Equatable {
    case heartTapped
    case removeFromFavorites
    case addToFavorites
}
```


#### Modeling what will happen when action appears {#modeling-what-will-happen-when-action-appears}

Here, we start to use TCA’s first feature: Reducer. TCA will receive all the action that the views will trigger and after that, the action will be processed through the reducer. In TCA, reducer is the place where logic happens. State mutations, logical operation, and action handling is happening in the reducer.

```swift

public let songReducer = Reducer<SongViewState, SongAction, SongEnvironment> { state, action, environment in
    switch action {
    case .heartTapped:
        if !state.isFavorite {
            return Effect(value: SongAction.addToFavorites)
        } else {
            return Effect(value: SongAction.removeFromFavorites)
        }

    case .addToFavorites, .removeFromFavorites:
        return .none
    }
}
```


#### Implement how the Song View will look like {#implement-how-the-song-view-will-look-like}

Simple, we create a view just like other SwiftUI views, but at the end, we’ll wire up the view with the state through a concept called `Store`

```swift

private struct TitleView: View {
    let title: String

    var body: some View {
        HStack {
            Spacer()
            Text(title)
                .font(.system(size: 32, weight: .bold, design: .`default`))
                .multilineTextAlignment(.center)
            Spacer()
        }
    }
}

private struct VerseView: View {
    let verse: Verse

    var body: some View {
        VStack(alignment: .center, spacing: 10) {
            ForEach(0..<self.verse.contents.count) { (j) in
                Text(self.verse.contents[j])
            }
        }
    }
}

public struct SongView: View {
    private let store: Store<SongViewState, SongAction>
    private let enableFavoriteButton: Bool

    public init(store: Store<SongViewState, SongAction>, enableFavoriteButton: Bool) {
        self.store = store
        self.enableFavoriteButton = enableFavoriteButton
    }

    public var body: some View {
        WithViewStore(self.store) { viewStore in
            ScrollView(.vertical, showsIndicators: true) {
                VStack(alignment: .center, spacing: 10) {
                    Spacer()
                    TitleView(title: viewStore.title)
                    Spacer()
                    ForEach(0..<viewStore.verses.count) { i in
                        Text("\(i + 1)")
                            .font(.system(.headline))
                        VerseView(verse: viewStore.verses[i])
                        Unwrap(viewStore.reff) { reff in
                            Spacer()
                            VerseView(verse: reff)
                        }
                        Spacer()
                    }
                    Spacer()
                }
            }
            .navigationBarTitle(Text("\(viewStore.prefix) no. \(viewStore.number)"))
            .navigationBarItems(
                trailing: Button(action: { viewStore.send(.heartTapped) }) {
                    Image(systemName: viewStore.isFavorite ? "heart.fill" : "heart")
                }
                .disabled(!self.enableFavoriteButton)
            )
        }
    }
}
```
