content/posts/my-take-on-the-composable-architecture.md


#### Previews {#previews}

Since we haven’t wire up the view to any entry point, we can use SwiftUI previews to see how our view implementation is going.

```swift

internal struct SongView_Previews: PreviewProvider {
    static var previews: some View {
        SongView(
            store: Store(
                initialState: SongViewState(
                    song: Song(
                        id: UUID(),
                        number: 1,
                        title: "Di Hadapan Hadirat-Mu",
                        verses: [
                            Verse(contents: [
                                "Di hadapan hadirat-Mu",
                                "Kami umat-Mu menyembah",
                                "Mengakui Engkau Tuhan",
                                "Allah kekal, Maha kuasa"
                            ]),
                            Verse(contents: [
                                "Dari debu dan tanahlah",
                                "kita dijadikan Tuhan",
                                "Dan bila tersesat kita",
                                "Tuhan tak akan tinggalkan",
                            ]),
                            Verse(contents: [
                                "Kuasa serta kasih Allah",
                                "Memenuhi seg’nap dunia",
                                "Tetap teguhlah firman-Nya",
                                "Hingga penuh hadirat-Nya",
                            ]),
                            Verse(contents: [
                                "Di pintu Surga yang suci",
                                "menyanyi beribu lidah",
                                "Pada Tuhan kita puji",
                                "Sekarang dan selamanya",
                            ])
                        ], songBook: .laguSion
                    ),
                    isFavorite: false
                ),
                reducer: songReducer,
                environment: SongEnvironment()),
            enableFavoriteButton: true
        )
    }
}
```


#### Testing the implementation {#testing-the-implementation}

```swift

class SongTests: XCTestCase {
    func testHeartTapped_WithIsFavorite_False() {
        let store = TestStore(
            initialState: SongViewState(
                song: Song(id: UUID(), number: 0, title: "", verses: [], songBook: .laguSion),
                isFavorite: false
            ),
            reducer: songReducer,
            environment: SongEnvironment()
        )

        store.assert(
            .send(.heartTapped),
            .receive(.addToFavorites)
        )
    }

    func testHeartTapped_WithIsFavorite_True() {
        let store = TestStore(
            initialState: SongViewState(
                song: Song(id: UUID(), number: 0, title: "", verses: [], songBook: .laguSion),
                isFavorite: true
            ),
            reducer: songReducer,
            environment: SongEnvironment()
        )

        store.assert(
            .send(.heartTapped),
            .receive(.removeFromFavorites)
        )
    }
}
```

For now, let’s take a break from coding and look back what we have made here. First, we have modeled the state of the Song View and actions. Next the reducer and the view. TCA provides us with a framework to pass triggers from view to the reducer through `Store` . With store, developer can make SwiftUI previews easily. This checks the first claim that TCA is ergonomic.

Second, testing. `Store` concept also has it’s corresponding ergonomic component in testing named `TestStore` . This component enable us to intercept the actions triggered, sequence of actions, or even checks the state after every action sent or received. This checks the second claim that TCA is designed with testing in mind.

Cool, so far we have covered how TCA is ergonomic and designed with testing in mind. Let’s go to the next part of the implementation to prove the rest TCA claims.


#### Modeling Main List View {#modeling-main-list-view}

In the list view state, we store two lists. The list of songs, and favorite songs.

```swift

public struct MainState: Equatable {
    public var songs: [Song]
    public var favoriteSongs: [Song]
    public var selectedBook: BookSelection
    public var searchQuery: String
    public var selectedSortOption: SortOptions
    public var actionSheet: ActionSheetState<MainAction>?
    public var alert: AlertState<MainAction>?

    public init(
        songs: [Song] = [],
        favoriteSongs: [Song] = [],
        selectedBook: BookSelection = .all,
        searchQuery: String = "",
        selectedSortOptions: SortOptions = .number,
        actionSheet: ActionSheetState<MainAction>? = nil,
        alert: AlertState<MainAction>? = nil
    ) {
        self.songs = songs
        self.favoriteSongs = favoriteSongs
        self.selectedBook = selectedBook
        self.searchQuery = searchQuery
        self.selectedSortOption = selectedSortOptions
        self.actionSheet = actionSheet
        self.alert = alert
    }
}

extension MainState {
    var currentSongs: [SongViewState] {
        get {
            var result: [Song] = []
            switch selectedBook {
            case .all:
                result = songs
            case .songBook(let songBook):
                result = songs(for: songBook)
            }

            return result.map { song -> SongViewState in
                SongViewState(song: song, isFavorite: favoriteSongs.contains(song))
            }
        }
        set {
        }
    }

    func songs(for songBook: SongBook) -> [Song] {
        return songs.filter { song in
            song.songBook == songBook
        }
    }
}
```


#### Modeling the Main List View Actions {#modeling-the-main-list-view-actions}

Here, we’re going to use our previously made `songReducer` for each song we have in the main list.

```swift

public enum MainAction: Equatable {
    case actionSheetDismissed
    case alertDismissed
    case appear
    case error(LaguSionError)
    case getSongs
    case setSongs([Song])
    case saveSearchQuery(String)
    case searchQueryChanged(String)
    case song(index: Int, action: SongAction)
    case songBookPicked(BookSelection)
    case sortOptionChanged(SortOptions)
    case sortOptionTapped
    case updateFavoriteSongs(newFavorites: [Song])

    case noOp
}

public let mainReducer: Reducer<MainState, MainAction, MainEnvironment> = .combine(
    songReducer.forEach(
        state: \MainState.currentSongs,
        action: /MainAction.song(index:action:),
        environment: { _ in SongEnvironment() }
    ),
    // ...
)
```

Let’s take a break and see what we did. First, we model the `MainState` just as we did on `SongViewState` . After that, we create the model of `MainAction` and `mainReducer` . This shows that building component in TCA is consistent. Every layer of the implementation follows the same consistent pattern. This checks the consistency claim.

Next, TCA also gave us the tools we need to reuse and compose the `songReducer` in the `mainReducer`. As we know, the main state, composes song state directly or indirectly. If this happens, we can always compose any state with many other smaller states and we can still have the visibility of anything that happens in the child component. This checks the composability claim.

Last experiment I’d like to show is to fast forward on how we’re going to wire multiple sibling states to the root state.

Assume we have implemented the `Settings` and `Favorites` section.
