content/posts/my-take-on-the-composable-architecture.md


#### Model App State {#model-app-state}

To wire up all the sibling states to single state, we have to define how are the `AppState` behave when there’s a change in `AppState` or if there’s any changes in the child states.

```swift

struct AppState: Equatable {
    var songs: [Song] = []
    var favoriteSongs: [Song] = []
    var selectedBook: BookSelection = .all
    var selectedSortOptions: SortOptions = .number
    var searchQuery: String = ""
    var mainActionSheet: ActionSheetState<MainAction>? = nil
    var mainAlert: AlertState<MainAction>? = nil
    var isAvailableOffline: Bool = false
    var fontSelection: FontSelection = .normal
    var contentSizeSelection: ContentSizeSelection = .normal
}

extension AppState {
    var main: MainState {
        get {
            MainState(
                songs: self.songs,
                favoriteSongs: self.favoriteSongs,
                selectedBook: self.selectedBook,
                searchQuery: self.searchQuery,
                selectedSortOptions: self.selectedSortOptions,
                actionSheet: self.mainActionSheet,
                alert: self.mainAlert
            )
        }
        set {
            self.songs = newValue.songs
            self.favoriteSongs = newValue.favoriteSongs
            self.selectedBook = newValue.selectedBook
            self.searchQuery = newValue.searchQuery
            self.selectedSortOptions = newValue.selectedSortOption
            self.mainActionSheet = newValue.actionSheet
            self.mainAlert = newValue.alert
        }
    }

    var favorites: FavoritesState {
        get {
            FavoritesState(songs: self.songs, favoriteSongs: self.favoriteSongs)
        }
        set {
            self.songs = newValue.songs
            self.favoriteSongs = newValue.favoriteSongs
        }
    }

    var settings: SettingsState {
        get {
            SettingsState(
                isAvailableOffline: self.isAvailableOffline,
                fontSelection: self.fontSelection,
                contentSizeSelection: self.contentSizeSelection
            )
        }
        set {
            self.isAvailableOffline = newValue.isAvailableOffline
            self.fontSelection = newValue.fontSelection
            self.contentSizeSelection = newValue.contentSizeSelection
        }
    }
}
```


#### Model Action and Reducer {#model-action-and-reducer}

```swift
enum AppAction {
    case main(MainAction)
    case favorites(FavoritesAction)
    case settings(SettingsAction)
}

let appReducer: Reducer<AppState, AppAction, AppEnvironment> = .combine(
    mainReducer.pullback(
        state: \AppState.main,
        action: /AppAction.main,
        environment: { env in
            MainEnvironment(
                mainQueue: env.mainQueue,
                laguSionDataSource: env.laguSionDataSource
            )
        }
    ),
    favoritesReducer.pullback(
        state: \AppState.favorites,
        action: /AppAction.favorites,
        environment: { _ in FavoritesEnvironment() }
    ),
    settingsReducer.pullback(
        state: \AppState.settings,
        action: /AppAction.settings,
        environment: { _ in SettingsEnvironment() }
    )
)
```

Let’s stop and review again. In this section, we made the state, actions, and reducer. But if we look closely, `appReducer` is doing nothing but composing all the child reducers and passing its respective states and actions using `pullback`. This ultimately checks again the composability claim of TCA.


## What I love {#what-i-love}

As we can see from the experiment, TCA delivers what it promised. Consistency, Composability, Testing, and Ergonomic. Personally, my favorite thing in TCA is how we can build mini components and wire it up to the chain until it has reaches the root/single source of truth. This ensures data consistency throughout screen and states.


## What I don't love {#what-i-don-t-love}

Right now, there's no valid proof that this architecture is used in a huge app with high complexity. So we still have no idea on the extent of this architecture.


## Where should I go next? {#where-should-i-go-next}

If you're interested in how this library is designed, go to [Composable Architecture series](https://www.pointfree.co/collections/composable-architecture). If you're into functional programming, especially in Swift, check out [Point-Free's site](https://www.pointfree.co). They cover a lot of interesting ideas of functional programming specifically in Swift. If need more example of a working app using TCA, visit [TCA's GitHub examples](https://github.com/pointfreeco/swift-composable-architecture#examples).


## References {#references}

-   <https://github.com/pointfreeco/swift-composable-architecture>
